app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    @pages = Page.order("created_at desc").page(params[:page]).per(10)

INSERT INTO "pages" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 13 Feb 2014 04:03:52 UTC +00:00], ["text", ""], ["title", ""], ["updated_at", Thu, 13 Feb 2014 04:03:52 UTC +00:00], ["user_id", 1]]
---
  def create
    @page = current_user.pages.new(post_params)

    if @page.save

UPDATE "pages" SET "text" = ?, "updated_at" = ? WHERE "pages"."id" = 2  [["text", "<p>testing</p>\r\n<p>&nbsp;</p>\r\n<p>edit text</p>"], ["updated_at", Thu, 13 Feb 2014 04:31:56 UTC +00:00]]
---
  def update
    @page = Page.friendly.find(params[:id])

    if @page.update(post_params)

DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 2]]
---
  def destroy
    @page = Page.friendly.find(params[:id])
    @page.destroy