app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (text LIKE '%undefined%' OR title LIKE '%undefined%')
SELECT COUNT(*) FROM "posts" WHERE (title like '%undefined')
---
  def index
    @posts = Post.revorder.page(params[:page]).per(10)

INSERT INTO "posts" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 01 Feb 2014 04:48:49 UTC +00:00], ["text", "teested"], ["title", "tester"], ["updated_at", Sat, 01 Feb 2014 04:48:49 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = current_user.posts.new(post_params)

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" ORDER BY created_at desc LIMIT 5
---
  def show
    @post = Post.friendly.find(params[:id])
    @recent_posts = Post.all(order:"created_at desc", limit: 5)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @post = Post.friendly.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "tested"], ["updated_at", Fri, 31 Jan 2014 05:10:13 UTC +00:00]]
---
  def update
    @post = Post.friendly.find(params[:id])

    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.friendly.find(params[:id])
    @post.destroy